[kernel] Update
